---

C#Visual BasicVisual C++

Revit 2024 API
---
SaveAsOptions..::..GetWorksharingOptions Method
SaveAsOptions Class See Also Send Feedback
---

Gets Worksharing options for SaveAs.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014

# Syntax

C#
---

    public WorksharingSaveAsOptions GetWorksharingOptions()

Visual Basic
---

    Public Function GetWorksharingOptions As WorksharingSaveAsOptions

Visual C++
---

    public:
    WorksharingSaveAsOptions^ GetWorksharingOptions()

#### Return Value

Defaults to nullNothingnullptra null reference (Nothing in Visual Basic). For a workshared model, if nullNothingnullptra null reference (Nothing in Visual Basic) default values for WorksharingSaveAsOptions are used.

# See Also

SaveAsOptions Class

Autodesk.Revit.DB Namespace